<?php

// Объявляем переменные перчаток разного типа

$green = 0;

$red = 0;

$blue = 0;

// Также объявляем результат переменной

$result = 0;

$input = ["green", "red", "blue", "green", "green", "blue", "red", "red"];

// Создаем цикл в котором будут записываться количество перчаток кажого цвета, применяя функцию count

for ($i=0; $i < count($input); $i++) {

if ($input[$i] == "green") {
$green += 1;

};

if ($input[$i] == "red") {
$red += 1;

};

if ($input[$i] == "blue") {
$blue += 1;

};
    return;
};

// Записываем на каждый тип пару(при этом воспользуемся функцией который округляет число в меньшую сторону)

$green = floor($green / 2);

$red = floor($red / 2);

$blue = floor($blue / 2);

// Записываем результат суммы

$result = $green + $red + $blue;

// Выводим результат

echo "Всего: $result($green зеленая пара, $red красная пара, $blue синяя пара)";
?>
